/*
A B C 
D E F 
G H I
移动    影响的时钟
 1         ABDE
 2         ABC
 3         BCEF
 4         ADG
 5         BDEFH
 6         CFI
 7         DEGH
 8         GHI
 9         EFHI
*/
/*把 每种操作影响的钟 转换为 每种钟收到哪些操作的影响
A 1 2 4
B 1 2 3 5
C 2 3 6
D 1 4 5 7
E 1 3 5 7 9
F 3 5 4 9
G 4 7 8
H 5 7 8
I 6 8 9
*/
/*
局部枚举
*/


#include<iostream>
using namespace std;
int main()
{
	int a[10],b[10];//a为时钟数组，b为拨钟数组
	for (int i = 1; i < 10; ++i)
	{
		cin >> a[i];
	}
	for (b[1] = 0; b[1] < 4; ++b[1])
	{
		for (b[2] =0; b[2] < 4; ++b[2])
		{
			for (b[3] =0; b[3] < 4; ++b[3])
			{
				a[1] = (a[1] + b[1] + b[2]) % 4;
				a[2] = (a[2] + b[1] + b[2] + b[3]) % 4;
				a[3] = (a[3] + b[2] + b[3]) % 4;
				
				for (int i = 1; i <= 3; ++i)
				{
					b[i+3] = (4 - a[i]) % 4;
					a[i] = (a[i] + b[i + 3]) % 4;
				}

				a[4] = (a[4] + b[1]+b[4]+b[5]) % 4;
				a[5] = (a[5] + b[1]+b[3]+b[5]) % 4;
				a[6] = (a[6] + b[3]+b[5]+b[6]) % 4;
				
				b[7] = (4 - a[4]) % 4;
				b[9] = (4 - a[6]) % 4;
				b[8] = (4 - (a[8] + b[5] + b[7] + b[9])%4) % 4;

				a[4] = (a[4] + b[7]) % 4;
				a[6] = (a[6] + b[9]) % 4;
				a[5] = (a[5] + b[7] + b[9]) % 4;

				a[7] = (a[7] + b[4] + b[7] + b[8]) % 4;
				a[8] = (a[8] + b[5] + b[7] + b[8] + b[9]) % 4;
				a[9] = (a[9] + b[6] + b[8] + b[9]) % 4;
				if (a[1] == 0 && a[2] == 0 && a[3] == 0 && a[4] == 0 && a[5] == 0 && a[6] == 0 && a[7] == 0 && a[8] == 0 && a[9] == 0)
				{
					for (int j = 1; j <= 9; j++)
						while (b[j]--)
							cout << j << " ";
					return 0;
				}
			}
		}
	}
}